# Import Library

In [1]:
# import libraries

import pandas as pd
import numpy as np
import os

# Create Path

In [2]:
path = r'C:\Users\james\Anaconda\Instacart Basket Analysis'

In [5]:
# import customers data

df_cus = pd.read_csv(os.path.join(path, '02 Data' , 'Original data' , 'customers.csv'), index_col = False)

In [7]:
 #check data info

df_cus.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

# Observation
Data wrangling

 - Column formats are not unified.<br/>
 - All variables provide essential information for the analysis, there's no need to drop any columns.<br/>
 - Column 'user_id' and 'age' are considered as categorical variables rather than numerical variables, they should be converted into 'string' values.<br/>

Data consistency check

- In column 'First Name', the non-null value count does not match with the rest of the columns. It is suspected that there're null values present in the column that should be investigated.<br/

In [8]:
# check data shape

df_cus.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Data Wrangling

In [9]:
# rename columns

df_cus = df_cus.rename(columns = {'First Name':'first_name' , 'Surnam':'surname' , 'Gender':'gender' , 'STATE':'state' , 'Age':'age' , 'dependants':'n_dependants', 'fam_status':'marital_status'})

In [10]:
# check output

df_cus.head()

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [11]:
# convert data type for column user_id from numerical to string

df_cus['user_id'] = df_cus['user_id'].astype('str')

In [12]:
# convert data type for column user_id from numerical to string

df_cus['age'] = df_cus['age'].astype('str')

In [13]:
# check results

df_cus.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  object
 1   first_name      194950 non-null  object
 2   surname         206209 non-null  object
 3   gender          206209 non-null  object
 4   state           206209 non-null  object
 5   age             206209 non-null  object
 6   date_joined     206209 non-null  object
 7   n_dependants    206209 non-null  int64
 8   marital_status  206209 non-null  object
 9   income          206209 non-null  int64
dtypes: int64(2), object(8)
memory usage: 15.7+ MB

In [1]:
#Obersvation: Data types of 'user_id' and 'age' are converted into 'Object' from 'inte64'. (string in Python)

In [14]:
# downsize data

df_cus = df_cus.astype({col: 'int32' for col in df_cus.select_dtypes('int64').columns})

In [15]:
# check results

df_cus.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  object
 1   first_name      194950 non-null  object
 2   surname         206209 non-null  object
 3   gender          206209 non-null  object
 4   state           206209 non-null  object
 5   age             206209 non-null  object
 6   date_joined     206209 non-null  object
 7   n_dependants    206209 non-null  int32
 8   marital_status  206209 non-null  object
 9   income          206209 non-null  int32
dtypes: int32(2), object(8)
memory usage: 14.2+ MB

# Data Consistency Check

In [18]:
for col in df_cus.columns:
    weird = df_cus[col].map(type) != type(df_cus[col].iloc[0])
    if weird.any():
        print(col)

first_name
n_dependants
income

In [19]:
# convert 'first_name' column data type to 'string'

df_cus['first_name'] = df_cus['first_name'].astype('str')

In [21]:
for col in df_cus.columns:
    weird = df_cus[col].map(type) != type(df_cus[col].iloc[0])
    if weird.any():
        print(col)

n_dependants
income

In [22]:
# check if there's anynull values in the dataframe

df_cus.isnull().sum()

user_id           0
first_name        0
surname           0
gender            0
state             0
age               0
date_joined       0
n_dependants      0
marital_status    0
income            0
dtype: int64

In [23]:
# cross check the results

df_cus.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  object
 1   first_name      206209 non-null  object
 2   surname         206209 non-null  object
 3   gender          206209 non-null  object
 4   state           206209 non-null  object
 5   age             206209 non-null  object
 6   date_joined     206209 non-null  object
 7   n_dependants    206209 non-null  int32
 8   marital_status  206209 non-null  object
 9   income          206209 non-null  int32
dtypes: int32(2), object(8)
memory usage: 14.2+ MB

In [24]:
# create a subset that only contains duplicates

df_dups = df_cus[df_cus.duplicated()]

In [25]:
# check the subset

df_dups

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, n_dependants, marital_status, income]
Index: []

In [26]:
# check value frequency in gender column

df_cus['gender'].value_counts(dropna = False)

gender
Male      104067
Female    102142
Name: count, dtype: int64

# Combine Dataframes

In [28]:
# import the other prepared Instacart data

ords_prods = pd.read_pickle (os.path.join(path, '02 Data' , 'Original Data' , '4.8 ords_prods_aggregated.pkl'))

In [29]:
ords_prods.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 24 columns):
 #   Column                     Dtype
---  ------                     -----
 0   order_id                   int64
 1   user_id                    int64
 2   order_number               int64
 3   order_dow                  int64
 4   order_hour_of_day          int64
 5   days_since_prior_order     float64
 6   product_id                 int64
 7   add_to_cart_order          int64
 8   reordered                  int64
 9   _merge                     category
 10  product_name               object
 11  aisle_id                   int64
 12  department_id              int64
 13  prices                     float64
 14  match                      category
 15  price_range_loc            object
 16  busiest_day                object
 17  busiest_period_of_the_day  object
 18  max_order                  int64
 19  loyalty_flag               object
 20  avg_order_price            float64
 21  spending_flag              object
 22  median_of_regularity       float64
 23  order_frequency_flag       object
dtypes: category(2), float64(4), int64(11), object(7)
memory usage: 5.4+ GB

In [30]:
# downsize dataframe by converting data type 

ords_prods = ords_prods.astype({col: 'int32' for col in ords_prods.select_dtypes('int64').columns})

In [33]:
# convert data type 

ords_prods = ords_prods.astype({'order_number':'int16', 'order_dow':'int16', 'order_hour_of_day':'int16', 'days_since_prior_order':'float16', 'department_id':'int16', 'prices':'float16','aisle_id':'int16', 'max_order':'int16','avg_order_price':'float32','median_of_regularity':'float16'})

In [34]:
# check output

ords_prods.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 24 columns):
 #   Column                     Dtype
---  ------                     -----
 0   order_id                   int32
 1   user_id                    int32
 2   order_number               int16
 3   order_dow                  int16
 4   order_hour_of_day          int16
 5   days_since_prior_order     float16
 6   product_id                 int32
 7   add_to_cart_order          int32
 8   reordered                  int32
 9   _merge                     category
 10  product_name               object
 11  aisle_id                   int16
 12  department_id              int16
 13  prices                     float16
 14  match                      category
 15  price_range_loc            object
 16  busiest_day                object
 17  busiest_period_of_the_day  object
 18  max_order                  int16
 19  loyalty_flag               object
 20  avg_order_price            float32
 21  spending_flag              object
 22  median_of_regularity       float16
 23  order_frequency_flag       object
dtypes: category(2), float16(3), float32(1), int16(6), int32(5), object(7)
memory usage: 3.0+ GB

In [35]:
# check the shape of newly imported dataframe

ords_prods.shape

(32404859, 24)

In [36]:
# check the shape of df_cus dataframe

df_cus.shape

(206209, 10)

In [37]:
# indentify key column in both dataframes

ords_prods.head(5)

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge,...,match,price_range_loc,busiest_day,busiest_period_of_the_day,max_order,loyalty_flag,avg_order_price,spending_flag,median_of_regularity,order_frequency_flag
0,2539329,1,1,2,8,NaN,196,1,0,both,...,both,Mid-range product,Regularly busy,Average orders,10,New customer,6.367796,Low spender,20.5,Non-frequent customer
1,2539329,1,1,2,8,NaN,14084,2,0,both,...,both,Mid-range product,Regularly busy,Average orders,10,New customer,6.367796,Low spender,20.5,Non-frequent customer
2,2539329,1,1,2,8,NaN,12427,3,0,both,...,both,Low-range product,Regularly busy,Average orders,10,New customer,6.367796,Low spender,20.5,Non-frequent customer
3,2539329,1,1,2,8,NaN,26088,4,0,both,...,both,Low-range product,Regularly busy,Average orders,10,New customer,6.367796,Low spender,20.5,Non-frequent customer
4,2539329,1,1,2,8,NaN,26405,5,0,both,...,both,Low-range product,Regularly busy,Average orders,10,New customer,6.367796,Low spender,20.5,Non-frequent customer

In [38]:
df_cus.head(5)

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [39]:
# check the data type of the key column in ords_prods dataframe

ords_prods['user_id'].dtype

dtype('int32')

In [40]:
# check the data type of the key column in df_cus dataframe

df_cus['user_id'].dtype

dtype('O')

In [41]:
# conver the data type of 'user_id' column in ords_prods dataframe

ords_prods['user_id'] = ords_prods['user_id'].astype ('str')

In [42]:
# check result

ords_prods['user_id'].dtype

dtype('O')

In [43]:
# Drop the existing '_merge' column from previous exercises

ords_prods = ords_prods.drop(columns=['_merge'])

In [44]:
ords_prods_cus = ords_prods.merge(df_cus, on = 'user_id' , indicator = True)

In [45]:
# Check shape of newly merged dataframe

ords_prods_cus.shape

(32404859, 33)

In [46]:
pd.options.display.max_columns = None

In [57]:
# check result

ords_prods_cus.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,price_range_loc,busiest_day,busiest_period_of_the_day,max_order,loyalty_flag,avg_order_price,spending_flag,median_of_regularity,order_frequency_flag,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.000000,Mid-range product,Regularly busy,Average orders,10,New customer,6.367796,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2539329,1,1,2,8,NaN,14084,2,0,Organic Unsweetened Vanilla Almond Milk,91,16,12.500000,Mid-range product,Regularly busy,Average orders,10,New customer,6.367796,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,2539329,1,1,2,8,NaN,12427,3,0,Original Beef Jerky,23,19,4.398438,Low-range product,Regularly busy,Average orders,10,New customer,6.367796,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2539329,1,1,2,8,NaN,26088,4,0,Aged White Cheddar Popcorn,23,19,4.699219,Low-range product,Regularly busy,Average orders,10,New customer,6.367796,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,2539329,1,1,2,8,NaN,26405,5,0,XL Pick-A-Size Paper Towel Rolls,54,17,1.000000,Low-range product,Regularly busy,Average orders,10,New customer,6.367796,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [60]:
# Check inner join value counts

ords_prods_cus['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [62]:
# Check inner join value counts

ords_prods_cus['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [63]:
ords_prods_cus.to_pickle(os.path.join(path, '02 Data','Original Data', 'orders_products_customers_merged.pkl'))